GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Src/fm33fh0xx_fl_uart.c
/**
  ****************************************************************************************************
  * @file    fm33fh0xx_fl_uart.c
  * @author  FMSH Application Team
  * @brief   Src file of UART FL Module
  ****************************************************************************************************
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  ****************************************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "fm33fh0xx_fl.h"

/** @addtogroup FM33FH0xx_FL_Driver
  * @{
  */

/** @addtogroup UART
  * @{
  */

#ifdef FL_UART_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup UART_FL_Private_Macros
  * @{
  */

#define     IS_UART_INSTANCE(INSTANCE)                     (((INSTANCE) == UART0)||\
                                                            ((INSTANCE) == UART1)||\
                                                            ((INSTANCE) == UART2)||\
                                                            ((INSTANCE) == UART3)||\
                                                            ((INSTANCE) == UART4)||\
                                                            ((INSTANCE) == UART5)||\
                                                            ((INSTANCE) == UART6)||\
                                                            ((INSTANCE) == UART7))
                                                           
#define     IS_FL_UART_CLKSRC(__VALUE__)                   (((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART0_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART1_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_UART2_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART2_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART2_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART2_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_UART3_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART3_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART3_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART3_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_UART4_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART4_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART4_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART4_CLK_SOURCE_XTHF)||\
                                                            ((__VALUE__) == FL_CMU_UART5_CLK_SOURCE_APBCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART5_CLK_SOURCE_RCHF)||\
                                                            ((__VALUE__) == FL_CMU_UART5_CLK_SOURCE_SYSCLK)||\
                                                            ((__VALUE__) == FL_CMU_UART5_CLK_SOURCE_XTHF))
                                                           
                                                           
#define     IS_FL_UART_DATAWIDTH(__VALUE__)                (((__VALUE__) == FL_UART_DATA_WIDTH_6B)||\
                                                            ((__VALUE__) == FL_UART_DATA_WIDTH_7B)||\
                                                            ((__VALUE__) == FL_UART_DATA_WIDTH_8B)||\
                                                            ((__VALUE__) == FL_UART_DATA_WIDTH_9B))
                                                           
#define     IS_FL_UART_STOPBITS(__VALUE__)                 (((__VALUE__) == FL_UART_STOP_BIT_WIDTH_1B)||\
                                                            ((__VALUE__) == FL_UART_STOP_BIT_WIDTH_2B))
                                                           
